package site.timecapsulearchive.core.global.util.nickname;

import java.util.List;
import lombok.Getter;
import lombok.RequiredArgsConstructor;

@Getter
@RequiredArgsConstructor
public enum RandomNickName {

    NICK(
        List.of(
            "기분나쁜", "기분좋은", "신바람나는", "상쾌한", "짜릿한", "그리운", "자유로운",
            "서운한", "울적한", "비참한", "위축되는", "긴장되는", "두려운", "당당한", "배부른", "수줍은",
            "창피한", "멋있는", "열받은", "심심한", "잘생긴", "이쁜", "시끄러운", "신비로운", "따뜻한",
            "신나는", "소심한", "씩씩한", "순수한", "담백한", "활기찬", "단호한", "은은한", "우아한",
            "반짝이는", "신랄한", "센치한", "도도한", "행복한", "선명한", "애틋한", "깔끔한", "유쾌한",
            "신선한", "산뜻한", "쾌활한", "훈훈한", "몽환적인", "쿨한", "흥분된", "완벽한", "존경받는"
        )
    ),

    NAME(
        List.of(
            "사자", "코끼리", "호랑이", "곰", "여우", "늑대", "너구리", "침팬치", "고릴라", "참새",
            "고슴도치", "강아지", "고양이", "거북이", "토끼", "앵무새", "하이에나", "돼지", "하마", "원숭이",
            "물소", "얼룩말", "치타", "악어", "기린", "수달", "염소", "다람쥐", "판다", "파이어폭스",
            "오소리", "밍크", "레서판다", "기러기", "펭귄", "오리", "카멜레온", "비둘기", "앵무새", "햄스터", "코뿔소",
            "푸들", "꿀벌", "돌고래", "별", "달팽이", "바다거북", "코알라", "타조", "하늘다람쥐", "기니피그", "조개"
        )
    );

    private final List<String> value;
}

